In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv("Bank_Customer.csv")

In [4]:
df

       age           job  marital  education  balance duration
0     58.0    management  married   tertiary     2143      261
1     44.0    technician   single  secondary       29      151
2     33.0  entrepreneur  married  secondary        2       76
3     47.0   blue-collar  married    unknown     1506       92
4     33.0       unknown   single    unknown        1      198
...    ...           ...      ...        ...      ...      ...
1085   NaN        admin.  married    primary      136      283
1086   NaN   blue-collar   single    unknown     2167     1273
1087   NaN   blue-collar  married  secondary      309     1574
1088   NaN    technician  married  secondary      221      139
1089   NaN   blue-collar  married    primary      321      228

[1090 rows x 6 columns]

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1090 entries, 0 to 1089
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        1000 non-null   float64
 1   job        1090 non-null   object
 2   marital    1090 non-null   object
 3   education  1090 non-null   object
 4   balance    1090 non-null   int64
 5   duration   1090 non-null   object
dtypes: float64(1), int64(1), object(4)
memory usage: 51.2+ KB

In [6]:
# count number of cells that are string in "duration" column
df['duration'].apply(lambda x: isinstance(x, str)).sum()

1090

In [7]:
df.loc[df['duration'] == 'zero', 'duration'].count()

9

In [8]:
df['duration'].replace('zero',0 , inplace = True)

In [9]:
# convert all to int
df['duration'] = df['duration'].astype(int)

In [10]:
type(df.at[526 , 'duration'])

numpy.int32

In [11]:
# drop all rows that have NaN values in the column "age"
df.dropna(subset = 'age', inplace = True)

In [12]:
stats = pd.DataFrame(df.groupby(['education']).describe())

In [13]:
pd.set_option('display.max_columns',24)

In [14]:
stats

             age                                                     balance  \
           count       mean       std   min    25%   50%   75%   max   count
education
primary    155.0  45.651613  8.157216  28.0  39.00  45.0  52.5  61.0   155.0
secondary  570.0  41.540351  9.218455  22.0  34.00  40.0  49.0  61.0   570.0
tertiary   186.0  41.370968  8.954963  27.0  33.25  40.0  48.0  60.0   186.0
unknown     89.0  46.438202  7.591794  30.0  41.00  46.0  53.0  60.0    89.0

                                                                          \
                  mean          std    min    25%    50%    75%      max
education
primary     365.651613   762.747593 -454.0  18.00  139.0  356.0   5431.0
secondary   508.400000  2622.819492 -932.0  18.25  155.5  432.5  58544.0
tertiary    782.241935  2313.298866 -364.0  48.75  230.5  505.0  24598.0
unknown    1000.449438  4815.566055 -532.0  24.00  178.0  573.0  45248.0

          duration                                                       \
             count        mean         std   min     25%    50%     75%
education
primary      155.0  253.664516  218.825563   0.0  124.50  189.0  301.00
secondary    570.0  272.968421  247.822253   0.0  136.00  201.5  314.25
tertiary     186.0  262.424731  255.238282   0.0  119.25  195.0  321.25
unknown       89.0  258.415730  250.116510  13.0  107.00  209.0  315.00


              max
education
primary    1778.0
secondary  1906.0
tertiary   2033.0
unknown    1623.0

In [15]:
df['marital'].value_counts()

married     637
single      220
divorced    143
Name: marital, dtype: int64

In [16]:
df.loc[df['balance']>2000, "job"].value_counts()

management       11
blue-collar       9
services          8
admin.            8
technician        6
retired           3
unemployed        1
housemaid         1
self-employed     1
Name: job, dtype: int64

In [30]:
df['balance'].nlargest()

920    58544
446    45248
334    24598
69     12223
34     10635
Name: balance, dtype: int64

In [35]:
df.loc[df['balance'].nlargest().index , ['balance', 'job']]

     balance          job
920    58544       admin.
446    45248   technician
334    24598   management
69     12223  blue-collar
34     10635   management

In [60]:
df['high balance & high education'] = (df['education'] == 'tertiary') & (df['balance'] > 5000)

In [61]:
df.loc[(df['education'] == 'tertiary') & (df['balance'] > 5000)]

,age,job,marital,education,balance,duration,"high balance,high education",high balance & high education
34,51.0,management,married,tertiary,10635,336,True,True
65,51.0,management,married,tertiary,6530,91,True,True
334,45.0,management,divorced,tertiary,24598,313,True,True
391,37.0,technician,married,tertiary,8730,149,True,True
493,55.0,unemployed,married,tertiary,5345,278,True,True
757,55.0,housemaid,divorced,tertiary,6920,406,True,True
916,40.0,services,single,tertiary,8823,378,True,True

In [62]:
df

,age,job,marital,education,balance,duration,"high balance,high education",high balance & high education
0,58.0,management,married,tertiary,2143,261,False,False
1,44.0,technician,single,secondary,29,151,False,False
2,33.0,entrepreneur,married,secondary,2,76,False,False
3,47.0,blue-collar,married,unknown,1506,92,False,False
4,33.0,unknown,single,unknown,1,198,False,False
...,...,...,...,...,...,...,...,...
995,37.0,blue-collar,married,primary,310,474,False,False
996,34.0,admin.,married,secondary,475,559,False,False
997,43.0,blue-collar,married,primary,61,261,False,False
998,49.0,services,married,secondary,1377,1101,False,False
999,33.0,technician,single,secondary,56,236,False,False